<a href="https://colab.research.google.com/github/slpitz/RNNandGHGs/blob/master/RNN_MaunaLoa_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
 
# importing pandas module   
import pandas as pd

Import monthly average CO2 from Mauna Loa

In [23]:
# importing pandas module   
import pandas as pd   

myfile = 'ftp://aftp.cmdl.noaa.gov/data/trace_gases/co2/flask/surface/co2_mlo_surface-flask_1_ccgg_month.txt'
myfile2019 = 'ftp://aftp.cmdl.noaa.gov/data/trace_gases/co2/in-situ/surface/mlo/co2_mlo_surface-insitu_1_ccgg_MonthlyData.txt'
      
# making data frame   
#df = pd.read_csv(myfile,sep='\t',skiprows=(0,1,2),header=(70))
#df = pd.read_csv(myfile,sep='\r',header=(69), delim_whitespace=True)
#df = pd.read_csv(myfile2019, header= (70), delim_whitespace=True)
df = pd.read_csv(myfile2019, header= (149), delim_whitespace=True)
    
df.head(10)

  site_code  year  month  day  ...  altitude  elevation  intake_height  qcflag
0       MLO  1973      1    1  ...    3437.0     3397.0           40.0     *..
1       MLO  1973      2    1  ...    3437.0     3397.0           40.0     *..
2       MLO  1973      3    1  ...    3437.0     3397.0           40.0     *..
3       MLO  1973      4    1  ...    3437.0     3397.0           40.0     *..
4       MLO  1973      5    1  ...    3437.0     3397.0           40.0     *..
5       MLO  1973      6    1  ...    3437.0     3397.0           40.0     *..
6       MLO  1973      7    1  ...    3437.0     3397.0           40.0     *..
7       MLO  1973      8    1  ...    3437.0     3397.0           40.0     *..
8       MLO  1973      9    1  ...    3437.0     3397.0           40.0     *..
9       MLO  1973     10    1  ...    3437.0     3397.0           40.0     *..

[10 rows x 17 columns]

In [24]:
df.columns

Index(['site_code', 'year', 'month', 'day', 'hour', 'minute', 'second',
       'time_decimal', 'value', 'value_std_dev', 'nvalue', 'latitude',
       'longitude', 'altitude', 'elevation', 'intake_height', 'qcflag'],
      dtype='object')

In [19]:
#df.columns = ['stationID', 'year', 'month', 'concentration']
df.head()

  stationID  year  month  concentration
0       MLO  1969      9         321.36
1       MLO  1969     10         320.74
2       MLO  1969     11         321.98
3       MLO  1969     12         323.78
4       MLO  1970      1         325.13

In [ ]:
import tensorflow
from tensorflow import keras